harness/mutants/patches/H1-backup-scan-without-read-session.patch
diff --git a/packages/orez-lite/src/cf-do/namespace-backup.ts b/packages/orez-lite/src/cf-do/namespace-backup.ts
--- a/packages/orez-lite/src/cf-do/namespace-backup.ts
+++ b/packages/orez-lite/src/cf-do/namespace-backup.ts
@@ -613,7 +613,21 @@ export function createNamespaceBackupManager<Env>(
             tables,
             cursor,
             scanChunkBytes
-          )(snapshot.lease)
+          )({
+            readPage: (table, afterRowid, limit) =>
+              options.query(
+                env,
+                namespace,
+                `SELECT rowid AS __orez_backup_rowid, ${tables
+                  .find((entry) => entry.name === table)!
+                  .columns.map(
+                    (column, index) => `"${column.replaceAll('"', '""')}" AS c${index}`
+                  )
+                  .join(', ')} FROM "${table.replaceAll('"', '""')}" WHERE rowid > ? ORDER BY rowid LIMIT ?`,
+                [afterRowid, limit]
+              ),
+            [Symbol.dispose]() {},
+          })
           for (const line of chunk.lines) appendLine(line)
           for (const [table, count] of Object.entries(chunk.tableRows)) {
             tableRows[table] = (tableRows[table] ?? 0) + count
