harness/mutants/patches/M4-lmid-no-change-row.patch
diff --git a/crates/sync-core/src/store.rs b/crates/sync-core/src/store.rs
index 63245cc..c735341 100644
--- a/crates/sync-core/src/store.rs
+++ b/crates/sync-core/src/store.rs
@@ -195,14 +195,5 @@ pub(crate) fn advance_lmid(
          WHERE clientGroupID = ? AND clientID = ?",
         &[counter(mutation_id), text(client_group_id), text(client_id)],
     )?;
-    // the lmid row carries the group so a diff derives acks for its OWN group
-    // only (never leaking a peer group's lmid); the lmid value rides as text so
-    // it too avoids any number path.
-    db.exec(
-        "INSERT INTO _zsync_changes (tableName, op, pk)
-         VALUES ('_zsync_clients', 'lmid',
-                 json_object('clientGroupID', ?, 'clientID', ?, 'lmid', ?))",
-        &[text(client_group_id), text(client_id), counter(mutation_id)],
-    )?;
     Ok(())
 }
